# coding: utf-8

"""
    存放main views中的一些共有的方法
"""

from django.contrib.auth.decorators import login_required, permission_required
from django.db import connection
from django.shortcuts import render_to_response

from main.models import TDimAppFilter, TDimWeek, TSysEventCategory, TSysApp, UmengApps
import calendar, functools
from django.contrib import auth
from common.views import *

def report_render(request, template, context = None):
    """
    增加权限控制
    :param request:
    :param template:
    :param context:
    :return:
    """
    context = context if context is not None else {}
    objs = AuthUserUserPermissions.objects.filter(user=request.user)
    for obj in objs:
        if obj.permission.content_type_id == PermissionType.MODULE or obj.permission.content_type_id == PermissionType.USER_ON:
            context[obj.permission.name] = True
    return render_to_response(template, context)

def add_main_var(f):
    @functools.wraps(f)
    def _(*args, **kwargs):
        result = f(*args, **kwargs)
        # 查找所有的应用
        all_appobjs = TSysApp.objects.all()
        items = []
        for appobj in all_appobjs:
            items.append("['%s', '%s']" % (appobj.app_key, appobj.app_name))
        apps_str = "[%s]" % ",".join(items)
        vars = {
            "user": auth.get_user(args[0]).username,
            # "lasturl": args[0].path,
            "lasturl": args[0].get_full_path(),
            "apps": apps_str
        }
        for key in vars:
            result.content = result.content.replace("{_tongji_begin_%s_end_}" % key, vars[key])
        return result

    return _


class MainConst:
    USER_ON = "用户模块开关"


class PeriodType(object):
    """
    按时间段，日/周/月
    """
    DAY = 1
    WEEK = 2
    MONTH = 3


def get_channels_versions(app_key):
    """
    获取app对应的渠道和版本
    :param app_key:
    :return:
    """
    channels = set()
    versions = set()
    all_objs = TDimAppFilter.objects.filter(app_key=app_key)
    for obj in all_objs:
        channels.add(obj.channel_no)
        versions.add(obj.app_version)
    # 对渠道和版本进行排序
    cl = list(channels)
    vl = list(versions)
    cl.sort()
    vl.sort(reverse=True)
    return cl, vl


def get_month_last_day(ym):
    """
    根据年月活得最后一天
    :param ym: 例如201507
    :return: 例如"20150731"
    """
    lastday = calendar.monthrange(ym / 100, ym % 100)[1]
    return "%d%d" % (ym, lastday)


def get_statweeks(start_date, end_date):
    """
    获取周列表，计算方式为i_weekstart在start_date和end_date之间
    :param start_date: 起始日期
    :param end_date: 结束日期
    :return:
    """
    weekobjs = TDimWeek.objects.filter(i_weekstart__gte=start_date,
                                       i_weekstart__lte=end_date)
    i_weeks = []
    week_maps = {}
    for weekobj in weekobjs:
        i_weeks.append(weekobj.i_week)
        week_maps[str(weekobj.i_week)] = [weekobj.i_weekstart, weekobj.i_weekend]
    return i_weeks, week_maps


def get_categorys():
    categorys = TSysEventCategory.objects.all()
    result = {}
    for category in categorys:
        k = str(category.main_category)
        v = [category.id, str(category.sub_category)]
        if k not in result:
            result[k] = []
        result[k].append(v)
    return result


def get_maincategory_gojs():
    """
    首页分类入口
    :return:
    """
    gj = {}
    gj['class'] = "go.GraphLinksModel"
    gj['nodeKeyProperty'] = "id"
    gj['nodeDataArray'] = [
        {"text": "启动次数  ", "name": "launches_count", "id": 0, "loc": "57.68668388033234 -85.41257223342402"},
        {"text": "首页分类入口  ", "name": "", "loc": "45.27418388033245 -11.347623874421004", "id": -2},
        {"text": "商品详情页  ", "name": "-d_homecategory-d_lists-d_details", "loc": "48.69327432957056 219.07510542265663", "id": -7},
        {"text": "预约页  ", "name": "-d_homecategory-d_lists-d_details-d_order", "loc": "67.76875802332005 293.9407770367191", "id": -8},
        {"text": "支付页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_pay", "loc": "66.90136482640582 364.42514691484365", "id": -9},
        {"text": "支付结果页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_pay-d_payresult", "loc": "52.70416289191722 433.8127158480273", "id": -10},
        {"text": "分类首页  ", "name": "-d_homecategory", "loc": "54.951039563081295 73.5639668774861", "id": -11},
        {"text": "商品列表页  ", "name": "-d_homecategory-d_lists", "loc": "54.218433402890525 142.80424185703131", "id": -12},
        {"text": "商品列表页  ", "name": "-d_lists", "id": -13, "loc": "235.9707408794534 142.1874977094142"},
        {"text": "商品详情页  ", "name": "-d_lists-d_details", "loc": "233.41863503808645 218.17092053285177", "id": -14},
        {"text": "预约页  ", "name": "-d_lists-d_details-d_order", "loc": "246.27427882480492 290.0737521305862", "id": -15},
        {"text": "支付页  ", "name": "-d_lists-d_details-d_order-d_pay", "loc": "244.9182083426956 358.810607777344", "id": -16},
        {"text": "支付结果页  ", "name": "-d_lists-d_details-d_order-d_pay-d_payresult", "loc": "236.59699076843765 431.20592452300815", "id": -17},
        {"text": "支付结果页  ", "name": "-d_lists-d_details-d_order-d_payresult", "loc": "425.5899026117579 433.3869301781253", "id": -18},
        {"text": "支付结果页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_payresult", "loc": "-125.23439002457087 437.25395508425834", "id": -19}
    ]
    gj['linkDataArray'] = [
        {"from": 0, "to": -2, "name": "", "text": "",
         "points": [108.60967675624879, -46.72354974651736, 109.51026572221383, -33.781314571596454, 107.67809450710233,
                    -15.344229286256455, 108.28184929584708, -11.347528965350323]},
        {"from": -7, "to": -8, "name": "-d_homecategory-d_lists-d_details-d_order", "text": "",
         "points": [108.88358633097566, 257.75946016182286, 110.18209267649758, 269.2290587886678, 107.37775449396484,
                    282.86440439176556, 108.71436544001799, 293.9414700320777]},
        {"from": -8, "to": -9, "name": "-d_homecategory-d_lists-d_details-d_order-d_pay", "text": "",
         "points": [110.82216927868339, 332.63137776214523, 111.0546110990503, 344.82903489147435, 110.504639890819,
                    355.68413919621634, 110.35025018045908, 364.42661119660596]},
        {"from": -9, "to": -10, "name": "-d_homecategory-d_lists-d_details-d_order-d_pay-d_payresult", "text": "",
         "points": [111.02056802405698, 403.11346508880047, 111.5195432231789, 412.98040840898415, 109.70863943533024,
                    423.97666919615864, 110.13492700044605, 433.8128958725029]},
        {"from": -12, "to": -7, "name": "-d_homecategory-d_lists-d_details", "text": "",
         "points": [109.52239886966419, 181.49391424456076, 108.14726363609526, 193.7690119229929, 110.55198133804714,
                    204.1655474392982, 108.64127202558888, 219.08115674655352]},
        {"from": -2, "to": -11, "name": "-d_homecategory", "text": "",
         "points": [108.5975060665944, 27.343763606137216, 107.9548767714865, 48.491828240971806, 108.55046725688648,
                    61.50704585999724, 107.4348205692332, 73.57005327105979]},
        {"from": -11, "to": -12, "name": "-d_homecategory-d_lists", "text": "",
         "points": [106.41297168060727, 112.25264296647303, 107.50920243191396, 121.28244343944138, 104.77803375915444,
                    130.8079457592139, 107.02291880148434, 142.8151540355063]},
        {"from": -2, "to": -13, "name": "-d_lists", "text": "",
         "points": [188.0423738946773, 3.686360551869111, 309.50347839458533, -6.605309429370365, 291.3573573335072,
                    57.771453790573204, 292.2750516119076, 142.187743803499]},
        {"from": -13, "to": -14, "name": "-d_lists-d_details", "text": "",
         "points": [291.55550930791117, 180.87771589239796, 291.5030973273584, 192.56382573917574, 291.1902289796604,
                    208.38759898570666, 290.51192632700963, 218.17094260876218]},
        {"from": -14, "to": -15, "name": "-d_lists-d_details-d_order", "text": "",
         "points": [291.45677473579417, 256.86146470018707, 291.786889716461, 268.68566052751066, 292.09033899199676,
                    278.5086629188236, 290.8130417556843, 290.07812055665244]},
        {"from": -15, "to": -16, "name": "-d_lists-d_details-d_order-d_pay", "text": "",
         "points": [289.53013678714717, 328.7640329140758, 289.8088196304781, 338.97996076267344, 289.21746315005123,
                    349.9385875692773, 288.80313546746754, 358.81305220827767]},
        {"from": -16, "to": -17, "name": "-d_lists-d_details-d_order-d_pay-d_payresult", "text": "",
         "points": [291.43366989081267, 397.4886979997872, 293.18659847094165, 407.95470052126467, 290.1219488664507,
                    420.37182422476343, 291.86534421755385, 431.2077186732951]},
        {"from": -15, "to": -18, "name": "-d_lists-d_details-d_order-d_payresult", "text": "",
         "points": [330.20281505060825, 305.8366398986308, 456.5690320207502, 293.90780148133865, 490.29089462989003,
                    328.55951144234183, 483.22807555528215, 433.38728255960285]},
        {"from": -8, "to": -19, "name": "-d_homecategory-d_lists-d_details-d_order-d_payresult", "text": "",
         "points": [67.77130860961206, 309.03167191826077, -109.18444816217969, 291.52622695652144, -65.23400620494405,
                    403.9513517556033, -67.61775470793968, 437.25428690698703]}
    ]
    return gj

def get_tabcategory_gojs():
    """
    分类tab分类入口
    :return:
    """
    gj = {}
    gj['class'] = "go.GraphLinksModel"
    gj['nodeKeyProperty'] = "id"
    gj['nodeDataArray'] = [
        {"loc": "54.21634392050282 -167.36407480153358", "text": "启动次数  ", "name": "launches_count", "id": 0},
        {"id": -2, "text": "分类tab分类入口  ", "name": "", "loc": "35.492557989707535 -7.327336952546011"},
        {"id": -7, "text": "商品详情页  ", "name": "-d_homecategory-d_lists-d_details","loc": "44.86442964207056 219.07510542265666"},
        {"id": -8, "text": "预约页  ", "name": "-d_homecategory-d_lists-d_details-d_order","loc": "62.66363177332002 295.217058599219"},
        {"id": -9, "text": "支付页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_pay","loc": "62.70136482640575 364.42514691484354"},
        {"id": -10, "text": "支付结果页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_pay-d_payresult","loc": "49.70416289191722 433.8127158480273"},
        {"id": -11, "text": "分类首页  ", "name": "-d_homecategory", "loc": "57.63123084433134 70.88377559623608"},
        {"id": -12, "text": "商品列表页  ", "name": "-d_homecategory-d_lists", "loc": "48.8580508403905 142.80424185703131"},
        {"loc": "237.24702244195336 144.74006083441415", "text": "商品列表页  ", "name": "-d_lists", "id": -13},
        {"id": -14, "text": "商品详情页  ", "name": "-d_lists-d_details", "loc": "240.2746691005866 218.17092053285182"},
        {"id": -15, "text": "预约页  ", "name": "-d_lists-d_details-d_order","loc": "251.97268788730503 287.52118900558594"},
        {"id": -16, "text": "支付页  ", "name": "-d_lists-d_details-d_order-d_pay","loc": "255.60308709269555 355.10041965234393"},
        {"id": -17, "text": "支付结果页  ", "name": "-d_lists-d_details-d_order-d_pay-d_payresult","loc": "245.85799076843747 431.2059245230079"},
        {"id": -18, "text": "支付结果页  ", "name": "-d_lists-d_details-d_order-d_payresult","loc": "425.5899026117579 433.3869301781253"},
        {"id": -19, "text": "支付结果页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_payresult","loc": "-125.23439002457087 437.25395508425834"},
        {"text": "分类TAB进入  ", "name": "d_tabcategory_entry", "loc": "46.23016647123882 -84.35329595025118", "id": -20}
    ]
    gj['linkDataArray'] = [
        {"to": -8,
         "points": [116.31433068000797, 257.7622441503461, 117.00680272108838, 263.0385487528346, 116.0997732426303,
                    285.71428571428584, 114.95599537986152, 295.2206388321855], "from": -7,
         "name": "-d_homecategory-d_lists-d_details-d_order", "text": ""},
        {"to": -9,
         "points": [115.44215364918897, 333.9032411354155, 116.19047619047615, 339.04761904761915, 116.19047619047615,
                    354.2857142857144, 114.97823207233156, 364.4286801117379], "from": -8,
         "name": "-d_homecategory-d_lists-d_details-d_order-d_pay", "text": ""},
        {"to": -10,
         "points": [114.51658940705451, 403.11426561459837, 114.63502774624673, 404.77114441629607, 113.15478682941668,
                    417.82935706528156, 113.79133491823414, 433.8131691571561], "from": -9,
         "name": "-d_homecategory-d_lists-d_details-d_order-d_pay-d_payresult", "text": ""},
        {"to": -7,
         "points": [117.634791208819, 181.49558327560854, 117.15237891056329, 188.95851534650276, 117.40146794710944,
                    206.36838312164735, 116.39253693907506, 219.07961920920752], "from": -12,
         "name": "-d_homecategory-d_lists-d_details", "text": ""},
        {"to": -11,
         "points": [117.69929510386883, 31.364031897141494, 118.20213680507057, 49.4500509708055, 117.52892497026886,
                    61.89856715100827, 118.01758246479079, 70.88451326194695], "from": -2, "name": "-d_homecategory",
         "text": ""},
        {"to": -12,
         "points": [117.83370127542408, 109.5741483311807, 116.59287263727882, 121.89176523425864, 117.52892497026886,
                    138.68413146491724, 117.50016246484722, 142.80425404011672], "from": -11,
         "name": "-d_homecategory-d_lists", "text": ""},
        {"to": -13,
         "points": [200.26176288639715, 10.876053317001533, 308.2219973437501, 8.040573843749996, 311.3515412427951,
                    62.366839782169656, 307.24335009986396, 144.740845184673], "from": -2, "name": "-d_lists",
         "text": ""},
        {"to": -14,
         "points": [307.08181383180545, 183.43088231656802, 307.36505105924846, 194.31032693174976, 307.50677395340114,
                    209.04831706209706, 307.10973086732855, 218.17337461986463], "from": -13,
         "name": "-d_lists-d_details", "text": ""},
        {"to": -15,
         "points": [306.47986677563404, 256.86119613604853, 306.7164362567372, 267.7848713903613, 306.94216941131833,
                    276.8601025792299, 305.5734947784211, 287.52979867481616], "from": -14,
         "name": "-d_lists-d_details-d_order", "text": ""},
        {"to": -16,
         "points": [302.9281244905494, 326.21192519320687, 303.3328819291516, 336.02778583033535, 302.8768386484182,
                    346.56698843077606, 302.5720843858952, 355.10109145196805], "from": -15,
         "name": "-d_lists-d_details-d_order-d_pay", "text": ""},
        {"to": -17,
         "points": [304.4492692772902, 393.78635269696565, 305.75148171635084, 405.46811635749503, 302.1563923008938,
                    419.1149518252319, 303.4332019603739, 431.2066195083891], "from": -16,
         "name": "-d_lists-d_details-d_order-d_pay-d_payresult", "text": ""},
        {"to": -18,
         "points": [351.90232639475147, 304.20093047965827, 474.58957780937567, 297.3384137901827, 494.30587500000036,
                    343.81462500000026, 484.5977578338462, 433.38984108819034], "from": -15,
         "name": "-d_lists-d_details-d_order-d_payresult", "text": ""},
        {"to": -19,
         "points": [62.66427795888018, 312.0200737499863, -99.09572211624901, 304.054707208949, -71.60034879648973,
                    403.919528209677, -74.35356664316053, 437.25652644651507], "from": -8,
         "name": "-d_homecategory-d_lists-d_details-d_order-d_payresult", "text": ""},
        {"from": 0, "to": -20, "name": "d_tabcategory_entry", "text": "",
         "points": [120.17524445195585, -128.67286573218917, 120.60860765625011, -112.56803381250009, 119.2685120156251,
                    -100.5071730468751, 120.3406541532029, -84.35219846056984]},
        {"from": -20, "to": -2, "name": "",
         "points": [118.44466623863666, -45.66853076402159, 116.94562126656685, -33.38652580639921, 119.45089800126397,
                    -20.596832697982343, 118.37298591701595, -7.3271728434413035], "text": ""}
    ]
    return gj

def get_contents_gojs():
    """
    内容流入口
    :return:
    """
    gj = {}
    gj['class'] = "go.GraphLinksModel"
    gj['nodeKeyProperty'] = "id"
    gj['nodeDataArray'] = [
        {"loc": "52.31158201574091 -92.12597956343825", "text": "启动次数  ", "name": "launches_count", "id": 0},
        {"id": -2, "text": "内容流入口  ", "name": "", "loc": "60.01636751351705 -2.5654321906412525"},
        {"id": -7, "text": "商品详情页  ", "name": "-d_homecategory-d_lists-d_details","loc": "44.86442964207056 219.07510542265666"},
        {"id": -8, "text": "预约页  ", "name": "-d_homecategory-d_lists-d_details-d_order","loc": "62.66363177332002 295.217058599219"},
        {"id": -9, "text": "支付页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_pay","loc": "62.70136482640575 364.42514691484354"},
        {"id": -10, "text": "支付结果页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_pay-d_payresult","loc": "49.70416289191722 433.8127158480273"},
        {"id": -11, "text": "分类首页  ", "name": "-d_homecategory", "loc": "57.63123084433134 70.88377559623608"},
        {"id": -12, "text": "商品列表页  ", "name": "-d_homecategory-d_lists", "loc": "48.8580508403905 142.80424185703131"},
        {"loc": "237.24702244195336 144.74006083441415", "text": "商品列表页  ", "name": "-d_lists", "id": -13},
        {"id": -14, "text": "商品详情页  ", "name": "-d_lists-d_details", "loc": "240.2746691005866 218.17092053285182"},
        {"id": -15, "text": "预约页  ", "name": "-d_lists-d_details-d_order","loc": "251.97268788730503 287.52118900558594"},
        {"id": -16, "text": "支付页  ", "name": "-d_lists-d_details-d_order-d_pay","loc": "255.60308709269555 355.10041965234393"},
        {"id": -17, "text": "支付结果页  ", "name": "-d_lists-d_details-d_order-d_pay-d_payresult","loc": "245.85799076843747 431.2059245230079"},
        {"id": -18, "text": "支付结果页  ", "name": "-d_lists-d_details-d_order-d_payresult","loc": "425.5899026117579 433.3869301781253"},
        {"id": -19, "text": "支付结果页  ", "name": "-d_homecategory-d_lists-d_details-d_order-d_payresult","loc": "-111.93729103046942 435.7764996404692"},
        {"text": "商品详情页  ", "name": "-d_details", "loc": "-300.4661767474793 222.6117004938922", "id": -20},
        {"text": "预约页  ", "name": "-d_details-d_order", "loc": "-284.13484853150106 294.7624972779136", "id": -21},
        {"text": "支付页  ", "name": "-d_details-d_order-d_pay", "loc": "-282.0887235315011 367.6928722779137", "id": -22},
        {"text": "支付结果页  ", "name": "-d_details-d_order-d_pay-d_payresult","loc": "-294.26890432477444 435.85079451334985", "id": -23},
        {"text": "支付结果页  ", "name": "-d_details-d_order-d_payresult", "loc": "-464.49734853150113 435.8824972779137","id": -24}
     ]
    gj['linkDataArray'] = [
        {"to": -8,
         "points": [116.31433068000797, 257.7622441503461, 117.00680272108838, 263.0385487528346, 116.0997732426303,
                    285.71428571428584, 114.95599537986152, 295.2206388321855], "from": -7,
         "name": "-d_homecategory-d_lists-d_details-d_order", "text": ""},
        {"to": -9,
         "points": [115.44215364918897, 333.9032411354155, 116.19047619047615, 339.04761904761915, 116.19047619047615,
                    354.2857142857144, 114.97823207233156, 364.4286801117379], "from": -8,
         "name": "-d_homecategory-d_lists-d_details-d_order-d_pay", "text": ""},
        {"to": -10,
         "points": [114.51658940705451, 403.11426561459837, 114.63502774624673, 404.77114441629607, 113.15478682941668,
                    417.82935706528156, 113.79133491823414, 433.8131691571561], "from": -9,
         "name": "-d_homecategory-d_lists-d_details-d_order-d_pay-d_payresult", "text": ""},
        {"to": -7,
         "points": [117.634791208819, 181.49558327560854, 117.15237891056329, 188.95851534650276, 117.40146794710944,
                    206.36838312164735, 116.39253693907506, 219.07961920920752], "from": -12,
         "name": "-d_homecategory-d_lists-d_details", "text": ""},
        {"to": -11,
         "points": [118.7171015579444, 36.12554221119352, 119.01701216629033, 52.03606725580557, 118.20418951919909,
                    62.976313816193375, 118.59200635827125, 70.88392787283121], "from": -2, "name": "-d_homecategory",
         "text": ""},
        {"to": -12, "points": [118.45686479655959, 109.57491500620432, 118, 124.00000000000004, 118, 140.00000000000006,
                               117.91961540060203, 142.80444712618583], "from": -11, "name": "-d_homecategory-d_lists",
         "text": ""},
        {"to": -13,
         "points": [157.83872414914362, 14.320176771244654, 304.45537500000023, 6.945750000000004, 312.00750000000016,
                    91.50750000000005, 307.71742960726533, 144.7416766010277], "from": -2, "name": "-d_lists",
         "text": ""},
        {"to": -14,
         "points": [307.08181383180545, 183.43088231656802, 307.36505105924846, 194.31032693174976, 307.50677395340114,
                    209.04831706209706, 307.10973086732855, 218.17337461986463], "from": -13,
         "name": "-d_lists-d_details", "text": ""},
        {"to": -15,
         "points": [306.47986677563404, 256.86119613604853, 306.7164362567372, 267.7848713903613, 306.94216941131833,
                    276.8601025792299, 305.5734947784211, 287.52979867481616], "from": -14,
         "name": "-d_lists-d_details-d_order", "text": ""},
        {"to": -16,
         "points": [302.9281244905494, 326.21192519320687, 303.3328819291516, 336.02778583033535, 302.8768386484182,
                    346.56698843077606, 302.5720843858952, 355.10109145196805], "from": -15,
         "name": "-d_lists-d_details-d_order-d_pay", "text": ""},
        {"to": -17,
         "points": [304.4492692772902, 393.78635269696565, 305.75148171635084, 405.46811635749503, 302.1563923008938,
                    419.1149518252319, 303.4332019603739, 431.2066195083891], "from": -16,
         "name": "-d_lists-d_details-d_order-d_pay-d_payresult", "text": ""},
        {"to": -18,
         "points": [351.90232639475147, 304.20093047965827, 474.58957780937567, 297.3384137901827, 494.30587500000036,
                    343.81462500000026, 484.5977578338462, 433.38984108819034], "from": -15,
         "name": "-d_lists-d_details-d_order-d_payresult", "text": ""},
        {"to": -19,
         "points": [62.6636493351119, 314.9815405112172, -79.78259396460953, 316.1754649708596, -61.580977502190436,
                    403.3233173654882, -62.08430757970969, 435.77709073668626], "from": -8,
         "name": "-d_homecategory-d_lists-d_details-d_order-d_payresult", "text": ""},
        {"from": 0, "to": -2, "name": "", "text": "",
         "points": [118.88638157323865, -53.43545016760213, 119.68634090721272, -34.632386279286315, 119.23217028038142,
                    -17.860811529939703, 118.92172311224891, -2.56477363255365]},
        {"from": -2, "to": -20, "name": "-d_details", "text": "",
         "points": [60.01683745805474, 14.658160274513424, -277.83000000000015, 0, -224.9425913168849,
                    148.9275087339376, -230.17977855627146, 222.6129586400722]},
        {"from": -20, "to": -21, "name": "-d_details-d_order", "text": "",
         "points": [-231.26497901468005, 261.3030344327951, -231.15685299937155, 273.17298634492863,
                    -231.62470725600127, 284.79161544856476, -232.26914503660328, 294.76489333653944]},
        {"from": -21, "to": -22, "name": "-d_details-d_order-d_pay", "text": "",
         "points": [-232.21091818702908, 333.451343243709, -231.2998935064359, 343.54242694780777, -231.97198486908678,
                    355.01300464556135, -232.36643951541558, 367.6934303099428]},
        {"from": -22, "to": -23, "name": "-d_details-d_order-d_pay-d_payresult", "text": "",
         "points": [-231.66034921967668, 406.38411901011096, -231.36566224853973, 414.99761057696514,
                    -231.43820774097674, 424.1893312120378, -230.7328060211055, 435.8520535557496]},
        {"from": -21, "to": -24, "name": "-d_details-d_order-d_payresult", "text": "",
         "points": [-284.1342946484281, 316.46195505438624, -400.2075000000003, 321.93000000000023, -400.2075000000003,
                    384.77250000000026, -398.30569203760876, 435.88284306203093]}
    ]
    return gj

def get_sales_gojs():
    """
    秒杀入口
    :return:
    """
    gj = {}
    gj['class'] = "go.GraphLinksModel"
    gj['nodeKeyProperty'] = "id"
    gj['nodeDataArray'] = [
        {"loc": "48.88607163192834 34.61885891886928", "text": "启动次数  ", "name": "launches_count", "id": 0},
        {"id": -2, "text": "秒杀入口  ", "name": "", "loc": "55.48933641384761 124.3492331896494"},
        {"id": -7, "text": "商品详情页  ", "name": "-d_details", "loc": "44.86442964207056 219.07510542265666"},
        {"id": -8, "text": "预约页  ", "name": "-d_details-d_order", "loc": "62.66363177332002 295.217058599219"},
        {"id": -9, "text": "支付页  ", "name": "-d_details-d_order-d_pay","loc": "62.70136482640575 364.42514691484354"},
        {"id": -10, "text": "支付结果页  ", "name": "-d_details-d_order-d_pay-d_payresult","loc": "49.70416289191722 433.8127158480273"},
        {"id": -19, "text": "支付结果页  ", "name": "-d_details-d_order-d_payresult","loc": "-125.23439002457087 437.25395508425834"}
     ]
    gj['linkDataArray'] = [
        {"to": -8,
         "points": [116.31433068000797, 257.7622441503461, 117.00680272108838, 263.0385487528346, 116.0997732426303,
                    285.71428571428584, 114.95599537986152, 295.2206388321855], "from": -7,
         "name": "-d_details-d_order", "text": ""},
        {"to": -9,
         "points": [115.44215364918897, 333.9032411354155, 116.19047619047615, 339.04761904761915, 116.19047619047615,
                    354.2857142857144, 114.97823207233156, 364.4286801117379], "from": -8,
         "name": "-d_details-d_order-d_pay", "text": ""},
        {"to": -10,
         "points": [114.51658940705451, 403.11426561459837, 114.63502774624673, 404.77114441629607, 113.15478682941668,
                    417.82935706528156, 113.79133491823414, 433.8131691571561], "from": -9,
         "name": "-d_details-d_order-d_pay-d_payresult", "text": ""},
        {"to": -19,
         "points": [62.66427795888018, 312.0200737499863, -99.09572211624901, 304.054707208949, -71.60034879648973,
                    403.919528209677, -74.35356664316053, 437.25652644651507], "from": -8,
         "name": "-d_details-d_order-d_payresult", "text": ""},
        {"from": 0, "to": -2, "name": "",
         "points": [115.054200587924, 73.30989350542961, 115.36997005211805, 90.61549709565027, 114.54306454946254,
                    105.85866571191112, 115.05898802222946, 124.34924470830352], "text": ""},
        {"from": -2, "to": -7, "name": "-d_details",
         "points": [115.7112024526886, 163.04021357420734, 116.55000000000007, 183.75000000000009, 115.50000000000011,
                    200.5500000000001, 114.65661700202908, 219.0756227549975], "text": ""}
    ]
    return gj

def get_homecategory_gojs():
    """
    快捷预约入口
    :return:
    """
    gj = {}
    gj['class'] = "go.GraphLinksModel"
    gj['nodeKeyProperty'] = "id"
    gj['nodeDataArray'] = [
        {"text":"启动次数  ", "name": "launches_count", "id":-1, "loc":"115.38223465781266 -67.54082028750003"},
        {"text":"分类首页  ", "name": "","loc":"119.9656860523437 9.876025359375006", "id":-2},
        {"text":"预约页  ", "name": "-d_order","loc":"127.8156860523435 85.47602535937497", "id":-3},
        {"text":"支付页  ", "name": "-d_order-d_pay", "loc":"128.3156860523435 167.37602535937515", "id":-4},
        {"text":"支付结果页  ","name": "-d_order-d_pay-d_payresult", "loc":"114.11568605234379 238.77602535937504", "id":-5}
     ]
    gj['linkDataArray'] = [
        {"from": -1, "to": -2, "text": "","name": "",
         "points": [172.70859129040198, -28.849438669995422, 172.6526966197933, -16.254194312183014, 172.69112789378735,
                    -2.6820117644662247, 173.1274744365788, 9.876076438226466]},
        {"from": -2, "to": -3, "text": "","name": "-d_order",
         "points": [174.45322818695632, 48.566681564630635, 174.71758322874697, 61.223850216506015, 173.54915091076728,
                    73.9064073174117, 173.617018489016, 85.47654912190646]},
        {"from": -3, "to": -4, "text": "","name": "-d_order-d_pay",
         "points": [172.8318433803841, 124.16681478306948, 172.49684197036842, 137.97498038709927, 172.69847785617443,
                    155.71409159130314, 172.93298062403892, 167.37723470405774]},
        {"from": -4, "to": -5, "text": "","name": "-d_order-d_pay-d_payresult",
         "points": [175.11104787640485, 206.06695557802271, 176.0507716843097, 217.8883780476963, 175.8600613362512,
                    228.76545799176532, 175.5232409174125, 238.77623021013827]}
    ]
    return gj

def get_main_gojs():
    gj = {}
    gj['class'] = "go.GraphLinksModel"
    gj['nodeKeyProperty'] = "id"
    gj['linkDataArray'] = [
        {
            "from": 0,
            "to": -2,
            "name": "d_maincategory",
            "text": "",
            "points": [60.144752023475796, 50.478661642615606, 22.758938666149422, 65.7619277632363,
                       -11.714800250788448, 79.81721315908392, -42.09452655653145, 91.96256733634702]
        },
        {
            "from": 0,
            "to": -3,
            "name": "d_tabcategory",
            "text": "",
            "points": [92.41761130436942, 52.5907368324908, 87.25843761030346, 64.76720898393009,
                       79.90491000282717, 79.70452767752717, 73.6411280135009, 91.69094435296724]
        },
        {
            "from": 0,
            "to": -4,
            "name": "d_sales",
            "text": "",
            "points": [126.74387864098448, 52.446134564385574, 141.39539207584545, 63.42155516505043,
                       161.0832939508575, 78.16689150673025, 175.67029481682198, 91.81560878000509]
        },
        {
            "from": 0,
            "to": -5,
            "name": "d_contents",
            "text": "",
            "points": [145.71359316770344, 48.84095910589258, 183.39218390281033, 62.256274594696684,
                       221.61876687448327, 75.04580397697335, 266.1958678727913, 93.44915492424607]
        },
        {
            "from": -2,
            "to": -7,
            "text": "",
            "name": "d_details",
            "points": [-62.41107720600533, 130.13227462207692, -9.793451072977676, 168.04975581423287,
                       36.89724783495333, 192.51119038829012, 78.98733056308957, 220.61950967871667]
        },
        {
            "from": -3,
            "to": -7,
            "text": "",
            "name": "d_details",
            "points": [72.60251224979326, 130.3091379756728, 85.00733224798257, 162.73350563502683,
                       93.40451505874037, 194.58108969371946, 101.7399820386234, 220.4258913364982]
        },
        {
            "from": -4,
            "to": -7,
            "text": "",
            "name": "d_details",
            "points": [183.22601357214262, 130.24811406353632, 166.45799102213968, 154.55019278328328,
                       146.78792583958065, 185.59712055749466, 121.570294895768, 220.48917732342497]
        },
        {
            "from": -5,
            "to": -7,
            "text": "",
            "name": "d_details",
            "points": [273.538700595187, 127.92936031681604, 236.00500680200219, 152.48532540065742,
                       198.99023521956605, 177.1041066793409, 135.6054553562496, 220.61370874147164]
        },
        {
            "from": -7,
            "to": -8,
            "name": "d_order",
            "text": "",
            "points": [109.1298726984929, 259.0889490354023, 110.05946573462774, 272.1223970587147,
                       106.82754827560957, 287.302385617924, 107.81549200015644, 299.7319963014985]
        },
        {
            "from": -8,
            "to": -9,
            "name": "d_pay",
            "text": "",
            "points": [109.16138821943824, 338.42277301426986, 109.5822233956048, 354.35571323223473,
                       109.20000000000005, 368.5500000000002, 109.18067643264868, 379.9760493204943]
        },
        {
            "from": -9,
            "to": -10,
            "name": "d_payresult",
            "text": "",
            "points": [109.71629271026342, 418.66722297007414, 110.1892890091016, 430.77487849831346,
                       108.34904638222262, 444.2914185622355, 108.74942430526794, 456.3620763477898]
        }
    ]
    gj['nodeDataArray'] = [
        {"name": "launches_count", "text": "启动次数  ", "loc": "52.799999999999955 13.949999999999989", "id": 0},
        {"name": "d_maincategory", "text": "首页分类入口  ", "loc": "-153.54999999999995 91.65000000000002", "id": -2},
        {"name": "d_tabcategory", "text": "分类页分类入口  ","loc": "-6.5499999999999545 91.64999999999998", "id": -3},
        {"name": "d_sales", "text": "秒杀  ", "loc": "162.5 91.64999999999996", "id": -4},
        {"name": "d_contents", "text": "内容流  ", "loc": "261.20000000000016 89.55", "id": -5},
        {"name": "d_details", "text": "商品详情页  ", "loc": "50.299999999999976 220.40000000000015","id": -7},
        {"name": "d_order", "text": "预约页  ", "loc": "66.44190380390623 299.7317626796876","id": -8},
        {"name": "d_pay", "text": "支付页  ", "loc": "67.18278491093724 379.97604860546886", "id": -9},
        {"name": "d_payresult", "text": "支付结果页  ", "loc": "52.76748241093708 456.3615001210939","id": -10}
    ]
    return gj


def get_ument_app():
    ret_app = {}
    apps = UmengApps.objects.using('default').filter(mark=1).values('app_key', 'name')
    ret_app['apps'] = [dict(
        app_key=i['app_key'],
        name=i['name']
    ) for i in apps]
    return ret_app


def get_umeng_cate_tab():
    cursor = connection.cursor()
    cate_sql = "SELECT id,name FROM pt_cms_db.cms_navi_category WHERE parent_id = 0 AND fatherId = 0 AND type > 0;"
    cursor.execute(cate_sql)
    cate = [i[1] for i in cursor.fetchall()]
    return cate
